tap 'homebrew/fuse'
tap 'welldan97/nodebug'
tap 'welldan97/updater'
tap 'welldan97/whereami'

brew 'aspell'
brew 'atool'
# brew 'cabal-install'
brew 'cairo'
brew 'catimg'
brew 'ccat'
brew 'coreutils'
brew 'dark-mode'
brew 'direnv'
brew 'editorconfig'
brew 'elinks'
brew 'exiftool'
brew 'fasd'
brew 'ffmpeg'
brew 'gifsicle'
brew 'git-lfs'
brew 'gnu-typist'
brew 'googler'
brew 'gource'
brew 'graphviz'
brew 'hardlink-osx'
brew 'heroku-toolbelt'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'imagemagick'
brew 'jq'
brew 'libcaca'
brew 'lynx'
brew 'mas'
brew 'mediainfo'
brew 'moreutils'
brew 'mutt'
brew 'newsbeuter'
brew 'nodebug'
brew 'ntfs-3g'
brew 'peco'
brew 'pixman'
brew 'poppler'
brew 'pwgen'
brew 'ranger'
brew 'rclone'
brew 'redis'
brew 'rbenv'
brew 'ruby-build'
brew 'source-highlight'
brew 'speedtest_cli'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'translate-shell'
brew 'transmission'
brew 'tree'
brew 'typespeed'
brew 'unrar'
brew 'updater'
brew 'utimer'
brew 'w3m'
brew 'watchman'
brew 'yarn'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'amethyst'
cask 'android-file-transfer'
cask 'anki'
cask 'anybar'
cask 'betterzipql'
# cask 'clipmenu'
cask 'disk-inventory-x'
# cask 'dockertoolbox'
# cask 'emacs'
# cask 'firefox'
# cask 'flash'
# cask 'flux'
# cask 'fullcontact'
# cask 'github-desktop'
# cask 'google-chrome'
# cask 'google-drive'
# cask 'inkscape'
# cask 'iterm2-beta'
# cask 'lastpass'
# cask 'launchcontrol'
# cask 'numi'
# cask 'openemu'
# cask 'osxfuse'
# cask 'pandoc'
# cask 'postgres'
# cask 'programmer-dvorak'
# cask 'purevpn'
# cask 'qlcolorcode'
# cask 'qlimagesize'
# cask 'qlmarkdown'
# cask 'qlprettypatch'
# cask 'qlstephen'
# cask 'quicklook-csv'
# cask 'quicklook-json'
# cask 'rescuetime'
# cask 'screenhero'
# cask 'skitch'
# cask 'skype'
# cask 'slack'
# cask 'sqlitebrowser'
# cask 'staruml'
# cask 'steam'
# cask 'suspicious-package'
# cask 'the-unarchiver'
# cask 'toggldesktop'
# cask 'torbrowser'
# cask 'transmission'
# cask 'vagrant'
# cask 'vlc'
# cask 'webpquicklook'
# cask 'whereami'
# cask 'wkhtmltopdf'
# cask 'yed'
