tap 'caskroom/versions'
tap 'homebrew/fuse'
tap 'welldan97/nodebug'
tap 'welldan97/updater'
# tap 'welldan97/whereami'

brew 'aspell'
brew 'atool'
brew 'awscli'
brew 'cabal-install'
brew 'cairo'
brew 'catimg'
brew 'ccat'
brew 'cloc'
brew 'coreutils'
brew 'ctags'
brew 'dark-mode'
brew 'direnv'
brew 'dosbox'
brew 'editorconfig'
brew 'elinks'
brew 'exiftool'
brew 'fasd'
brew 'ffmpeg'
brew 'gifsicle'
brew 'git'
brew 'git-lfs'
brew 'gnu-typist'
brew 'googler'
brew 'gource'
brew 'gpg'
brew 'graphviz'
brew 'hardlink-osx'
# brew 'heroku-toolbelt'
brew 'highlight'
# brew 'htop' temporary
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'libcaca'
brew 'lynx'
brew 'mas'
brew 'mediainfo'
brew 'moreutils'
brew 'mutt'
brew 'newsboat'
brew 'nodebug'
brew 'ntfs-3g'
brew 'pandoc'
brew 'peco'
brew 'pixman'
brew 'pkg-config'
brew 'poppler'
brew 'pwgen'
brew 'ranger'
brew 'rclone'
brew 'redis'
brew 'rbenv'
brew 'ruby-build'
brew 'rsync'
brew 'source-highlight'
brew 'speedtest_cli'
brew 'shellcheck'
brew 'shfmt'
brew 'switchaudio-osx'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tldr'
brew 'translate-shell'
brew 'transmission'
brew 'tree'
brew 'typespeed'
brew 'unrar'
brew 'updater'
brew 'utimer'
brew 'tesseract'
brew 'w3m'
brew 'watchman'
brew 'yarn'
brew 'youtube-dl'
brew 'zeromq'
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

cask 'xquartz' # inkscape dependency

cask 'amethyst'
cask 'android-file-transfer'
cask 'anki'
cask 'anybar'
cask 'betterzipql'
cask 'brave'
cask 'calibre'
cask 'clipy'
cask 'disk-inventory-x'
cask 'docker-toolbox'
cask 'dwarf-fortress-lnp'
cask 'emacs'
cask 'firefox'
cask 'flux'
cask 'fullcontact'
cask 'github-desktop'
cask 'gitup'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'hyper'
cask 'inkscape'
cask 'iterm2'
cask 'java6'
cask 'karabiner-elements'
cask 'lastpass'
cask 'launchcontrol'
cask 'loopback'
cask 'minecraft'
cask 'numi'
cask 'openemu'
cask 'osxfuse'
cask 'postgres'
# cask 'programmer-dvorak' # this cask cannot be reinstalled
cask 'purevpn'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'rescuetime'
cask 'screenhero'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'sqlitebrowser'
cask 'staruml'
cask 'steam'
cask 'stremio'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'toggldesktop'
cask 'torbrowser'
cask 'transmission'
cask 'vagrant'
cask 'vlc'
cask 'webpquicklook'
# cask 'whereami'
cask 'wkhtmltopdf'
cask 'yed'
